/*
  Государство США определяет рост населения исходя из следующих стат-наблюдений.
  
    * Каждые 7 секунд в стране рождается 1 человек.
    * Каждые 13 секунд в стране умирает 1 человек.
    * Каждые 45 секунд в страну въезжает новый иммигрант.
*/
size(1280, 720);

final int SECONDS_IN_YEAR = 365 * 24 * 60 * 60; // Количество дней для расчета установлено в 365 дней
final int CURRENT_POPULATION = 312_032_486; // Нынешнее население

/*
  TODO:

    Вычислите и визуализируйте при помощи закрашенных окружностей, установленных в ряд в центре экрана,
    рост населения, если предположить, что темп роста не изменится...
    
      * через 1 год
      * через 10 лет
      * через 100 лет
      * через 1000 лет
*/

// int populationInOneYear = ...
// ...
// ellipse(...
